{"author_metadata": {"username": "NicoleC", "id": "28"}, "question_metadata": {"score": 13, "id": "34", "tags": "<planning><tropical-destinations>", "views": 433}, "text": "When I don't know where to go, I decide based on what kind of holiday I am looking for, listing requirements and then marking them against the country. What questions are relevant to you will depend on the type of holiday you are looking for, but probably the basic things to consider are: weather, season, relaxation, structures/accomodations, activities to do, beaches, sea/coral barrier,  food, language.\nFor example, when looking for an exotic place to go on honeymoon, if you are going in the summer then most exotic places have a rainy season, so you may want to consider a place where you will be able to do other things even if there is rain. For examples the Maldives is one of the most gorgeous places to go, but there is nothing apart from sand, sea and relaxation; therefore if it's raining you'll ruin the holiday. In that case a place like Mauritius would be a good compromise, as it has good-looking beaches but also plenty of activities.\nI agree that Google is always a good source of information to shortlist, then forums can help you decide at the end.\n", "question": {"subtitle": "Tropical destinations have to be one of the most popular categories, which means there are always deals popping up, so it's hard not to be driven by these deals.\nIf I'm merely looking at the destination, and not the deals to be had, how do I find out which tropical destination has the attributes that are most desirable to me?\nI need help even knowing what questions to ask, but a few which come to mind are:\n\nWhat is the hiking like nearby?\nWhat is the average wind speed like?\nWhat type of beaches are available (surfing, sunbathing, secluded, scenic)\nWhat is the water like? (Clear and calm, strong swell, covered with seaweed, etc.)\nIs the water good for swimming? (Counter-example: we took a trip to Broome, Western Australia and found out that basically one shouldn't swim at all during the time of year we were there due to jellyfish/stinger threats)\n\nAnd once I know what questions to ask about the destination, what is the best method of finding a good match?\n", "title": "What kind of questions should I be asking about tropical destinations?"}, "user_metadata": {"username": "Francesca Venturini", "reputation": 140, "id": "56"}, "answer_metadata": {"accepted": 1, "length": 1071, "score": 8, "upModVotes": 8, "downModVotes": 0, "id": "76"}, "id": "5729e6f9dc8aaa70b8d97eaae187e88e"}
