{"author_metadata": {"username": "Seanland", "id": "8"}, "question_metadata": {"score": 38, "id": "26", "tags": "<air-travel><around-the-world>", "views": 2696}, "text": "Round-the-world fares do exist.\nMost airline alliances and occasionally single airlines offer around the world fares.\n\nOneWorld (includes British Airways, American Airlines, Cathay Pacfic) \nStar Alliance (includes Lufthansa, United)\nAir New Zealand\n\nIt can be very cost effective, especially for premium class (business and first class fares). \nThere are limits on all of them, usually they prevent backtracking across a continent, a limited number of segments, and only visiting each continent once (once you leave you don't go back). \nFlyertalk is a forum with a lot of trip reports done on RTW fares (check the trip reports forum).\nIn response to your comment, usually if you arrive at one airport and depart from another then that counts as an overland segment and counts towards your ticket usage.\nFor example, if you flew from New York to Berlin, took the train to Madrid, and then flew out from Madrid to Cairo, three segments would be used:\n\nNew York - Berlin \nBerlin - Madrid (overland segment) \nMadrid - Cairo\n\nIt doesn't matter if you fly or not, it still takes away from your overall segment limit. A segment refers to one specific flight.\n", "question": {"subtitle": "I have heard rumours of such things, and have had a difficult time find information on \"around the world\" flights.  Are they worth it (do you have a limit between usage, do you save money.. etc.) and are there easy ways of getting more informed on them (specific sites, travel agencies)?\nEdit With the goal of maximum continental coverage, no specific start or finish locations\n", "title": "What should I know about \"Around The World\" flights?"}, "user_metadata": {"username": "victoriah", "reputation": 7229, "id": "30"}, "answer_metadata": {"accepted": 1, "length": 1152, "score": 30, "upModVotes": 30, "downModVotes": 0, "id": "32"}, "id": "b789c4d3ecab1f5efcfd13d6e7f2ac0c"}
