{"author_metadata": {"username": "David G.", "id": "75"}, "question_metadata": {"score": 14, "id": "123", "tags": "<trains><france><luxury><high-speed-rail><fares>", "views": 7582}, "text": "First Class on the TGV means a wider seat, power sockets, less people (so a generally quieter environment), and that's about it.\nStandard Premier on the Eurostar is pretty much the same, except you get a small cold dish and a cold alcoholic or non-alcoholic beverage.\nThe difference in price is more due to demand than the actual cost of the service.\nWhether it's worth it is up to you. The choice is not between Eurostar Standard Premier and TGV First Class, the choice is between Eurostar Standard and Standard Premier.\nIf the price difference between Eurostar Standard and Standard Premier is small enough to you that it's worth it to spend those two hours with more space, a power socket, and a small free meal, then go for it.\nnote: carriages 5 & 14 have power sockets on the Eurostar, so if you book a seat in one of those and buy yourself a nice meal from M&S to take on the train, the difference comes down only to the difference in seat size.\n", "question": {"subtitle": "I've checked the costs of first class travel by high speed train in France and to UK. According to pictures, first class seats in the Eurostar and TGV look similar in terms of legroom and width, while fares are not. I am not a business traveler but a tourist looking for extra comfort.\nI did a comparison of full-fare ticket prices on two trips that are similar in distance and travel time.\nFor instance, a trip from Paris to Lyon, which lasts 2 hours and covers 500km, costs about €100 full-fare in first class. Using the Eurostar between Paris and London, for a trip that is about the same length and duration, full fare in Standard Premier class is about €200.\nEurostar first class is far more expensive than TGV first class. Does the Eurostar first class offer services that are worth the extra cost?\n", "title": "What is the difference between Eurostar first class and French TGV first class?"}, "user_metadata": {"username": "victoriah", "reputation": 7229, "id": "30"}, "answer_metadata": {"accepted": 1, "length": 952, "score": 15, "upModVotes": 15, "downModVotes": 0, "id": "126"}, "id": "33b867de3e799321482b345c96bc8e02"}
