{"accepted": 0, "answer": "I agree with R.. I spent over four months in Delhi in 2009 and while I did bring over a couple of plug adapters with me it's much easier and cheaper to just buy them there. Any market will have them. Just remember that the price of almost anything in India is negotiable In addition to buying a couple of plug adapters you can also purchase a universal power strip with surge protector once you're there. It looks like this a and I think I paid the equivalent of 5 USD em for one in a market in Delhi. These are a good idea if you're bringing multiple electronics like laptop tablet phone ipod. The universal power strip is great for a couple reasons 1 You can plug in all of your electronics at once. My experience is that many Indian hotels hostels guest houses do not have many outlets so if you have multiple things to charge a power strip is your best friend. 2 Surge protection is really important especially if you're traveling during summer in India though you didn't specify when your trip was . Brownouts blackouts and power surges are common and you don't want your laptop to get fried. 3 If you have one of these you don't need to buy a lot of individual adapter plugs that are small and easy to lose. As I mentioned before though this is something you'll want to buy in India to make sure the powerstrip itself has the right plug. It'll probably be a grounded plug that looks like this a . The last thing is to make sure you check voltage requirements for anything you bring with you to plug in. A lot of electronic devices can automatically convert but things like hair dryers typically need a voltage converter to do it for them. ", "answerScore": "13", "authorUserId": "149", "authorUsername": "fredley", "downModVotes": 0, "id": 1179, "subtitle": "I'm travelling around a few cities in India from Delhi to Bangalore. What type of plug adapter should I pack? ", "tags": "<india><gear><electronic-items><power><adapters>", "title": "What kind of plug adapter should I pack for India?", "upModVotes": 13, "userId": "489", "userReputation": 3002, "username": "Laura", "views": 162115}
