{"author_metadata": {"username": "MrDatabase", "id": "72"}, "question_metadata": {"score": 37, "id": "110", "tags": "<usa><money><exchange><eu><eurozone>", "views": 47131}, "text": "I use five strategies to pay for things when I travel:\n\nThe best rates are often the rates you get with your American credit card or debit card. Try to charge as much as you can. The fees are very low and the exchange rates are fair. However, many American banks charge several dollars for every foreign currency transaction, so if you plan to spend a lot of time in Europe, you may want to apply for a credit card with low or free foreign currency transactions. Right now, Capital One has a reputation for being the best deal on foreign currency.\nMy second favorite strategy is to get cash out of foreign ATMs using my own bank's debit card attached to my checking account. I've never had a problem with this, but I have heard that if your PIN is more than 4 digits, it may not work internationally. There are a few countries where most ATMs don't like American bank cards, notoriously Japan. In Japan, if you can find a post office, they have ATMs that are happy to accept American bank cards.\nAny kind of transaction that involves a human being standing behind a counter changing money for you is going to be bloody expensive. Like, 15% expensive... or more. You have to pay for the person and the counter. I very rarely do this.\nVery rarely, in Europe, you will find yourself dealing with an automatic machine that ONLY accepts credit cards and which keeps asking you for a PIN or refusing to read your American credit card. The most common places I've had this happen:\n\nAutomatic ticket machines at railroad stations\nBicycle rental machines\nUnattended gas stations\nToll booths in France\n\nEssentially what's happening here is that European credit cards have an embedded chip and require a PIN, while American credit cards use a magnetic stripe. In some situations in Europe you must pay with a Chip and PIN credit card. See this question for information about getting a chip and pin card as an American. There is some evidence that Chip and PIN cards will be widely available to US bankcard holders in Fall 2015.\nIn a pinch, you'll discover that nicer hotels are often happy to convert money for you. The rates are not very good, but if you keep a few hundred dollars in US cash hidden away somewhere safe, it'll get you out of just about any kind of situation.\n\n", "question": {"subtitle": "I'm traveling from the US to Europe in a few weeks.  When and what is the best method of exchanging dollars for Euros?  \nI imagine there's options like:\n\nat the airport when you arrive in Europe\nat a bank in the US before you leave\nat a bank in Europe upon arriving\n\n", "title": "What is the best method for exchanging dollars for Euros?"}, "user_metadata": {"username": "Joel Spolsky", "reputation": 6914, "id": "54"}, "answer_metadata": {"accepted": 1, "length": 2267, "score": 46, "upModVotes": 46, "downModVotes": 0, "id": "151"}, "id": "09ae20235883e806025d591c3026dbfe"}
