{"accepted": 0, "answer": "Open tickets strong Be aware that there is no such thing as a completely open ticket. In my experience buying tickets from Australia there are open tickets for three months six months or twelve months. There are no tickets sold with validity beyond twelve months. If you find tickets where this does not hold I would love to hear about it The longer the ticket is open for the more expensive it will be. You do have to put an initial date on the return portion of the ticket but it will be changeable. Now the price to change the open return portion of the ticket will vary considerably based on the airline and the price of the ticket. Actually it depends on the codes on your ticket which you probably can't read but travel agents and airlines can. Sometimes it depends on who you bought your ticket from. I changed my 6 month open ticket a couple of times last year direct with the airline and they had to check with my travel agent whether I would have to pay for the changes. The good news is that some airlines offer free date changes for the open portion of your ticket including stopovers. Some other airlines tell you there will be a charge but may in fact not charge for the changes. Korean air changed my dates for free last year so I'm flying with them again this year. JAL used to do it for free but last time I flew with them they told me each change would be 100 USD this is a typical price but when I made changes they in fact didn't charge me. If you're going to buy your tickets online it may be difficult to ascertain for sure whether the date changes will be free or what they will cost. If the ticket site has a phone number you may be able to find out by calling them. But this is one reason why I still buy my plane tickets from travel agents so I can know all these details before they get my money. One way tickets strong Unless you're flying to a country you have residency all countries I know of have a policy that you must have a return or onward ticket. In practice whether this is checked depends on political things. If you are from a poor country and are visiting a rich country you are much more likely to be checked. Also if there is some situation between the countries. I don't think I've ever been asked for this on arrival but a friend was asked when visiting Malaysia from Australia last year. I have however been asked to show it many times when extending a visa or doing a visa run in Mexico. Still I've met many travellers braver than me who only ever use one way tickets for their long term travel. ", "answerScore": "7", "authorUserId": "131", "authorUsername": "russjman", "downModVotes": 0, "id": 1094, "subtitle": "Ive been doing some research on traveling to South America and staying for an extended period of time working vacation . The usual sources for flight info Kayak Expedia Hipmunk dont have any info on flights with open return dates. The other option would be to just buy a one way ticket then buy a return flight when I want to leave but Ive heard that international flights from South America are quite expensive. What would be the most cost effective solution? ", "tags": "<air-travel><planning><international-travel><tickets><south-america>", "title": "What is the best method of purchasing a ticket with an open return date?", "upModVotes": 7, "userId": "140", "userReputation": 42267, "username": "hippietrail", "views": 66697}
