{"accepted": 0, "answer": "What you want is an open return ticket. The outgoing flight is confirmed and the return is open . Depending on the type of ticket the return can be up to a year after departure strong . You can book the return ticket after departure subject to availability of course. Sometimes you can even change a confirmed return without penalty. You'll probably have to buy an open return ticket from a real travel agent I've never seen them for sale through the online sites like Expedia etc. Travel agents that specialize in a certain destination for immigrants are a good place to find these kinds of tickets. For example if you want to go to Brazil look for a travel agent that sells tickets to Brazilians immigrants living in the USA. You can often find listings in ethnic newspapers that will be distributed at restaurants and shops. Student travel agencies are also a good place to check as they sell tickets to students who will be studying abroad for an indeterminate amount of time. Open return tickets can be more expensive than simply buying a cheap fare guessing a return date and then paying a penalty to change the date if you need to. If you choose this option be very careful you understand the change rules to avoid paying too much. Finally I would be careful about only buying a one way ticket. Most countries have an onward travel rule which means that you must show proof that you are planning to leave the country. Usually this means having a return flight ticket. A bus a train ticket out of the country might em be accepted but I wouldn't count on it. This rule is not regularly enforced but I've seen cases where travelers without a ticket out of the country have been denied boarding. ", "answerScore": "22", "authorUserId": "131", "authorUsername": "russjman", "downModVotes": 0, "id": 1084, "subtitle": "Ive been doing some research on traveling to South America and staying for an extended period of time working vacation . The usual sources for flight info Kayak Expedia Hipmunk dont have any info on flights with open return dates. The other option would be to just buy a one way ticket then buy a return flight when I want to leave but Ive heard that international flights from South America are quite expensive. What would be the most cost effective solution? ", "tags": "<air-travel><planning><international-travel><tickets><south-america>", "title": "What is the best method of purchasing a ticket with an open return date?", "upModVotes": 22, "userId": "11", "userReputation": 4305, "username": "user27478", "views": 66697}
