{"accepted": 0, "answer": "Many hostels hotels offer single occupancy rooms so if you really want to stay in a private room it's good to take some time to look up ones which do. CouchSurfing a is an option AirBnB a is too although I've never used the latter. Charging for two people is the norm when booking accommodation and I usually don't bother bargaining for lower prices. The use less electricity is on dodgy grounds anyway as it's probably not a big component of the cost of a room it's about the lost opportunity to sell the bed to two people. Another cost that adds up quickly when travelling is transportation. I mostly travel by public transportation but then there are certain journeys that cannot be made within a city without a taxi or inter city travel that must be done by cars. Here staying in a hostel helps as you can often share travel itineraries with other travellers and pool in together for a ride. It's more fun to share the experience and it reduces costs. The easiest rides to share are ones from airports train bus stations as someone or the other does have to head the same way as you. Joining up with other travellers also helps for joining tours as many tours often have a minimum number of people needed to book one. Here's where you can bargain hard especially when you've a large group and going to bar this is useful if you have a group and happy hours are over you can still often get discounts on your bill if you ask sweetly make sure you sort this out before em ordering booking an adventure tour etc if you've a group of 3 4 people and above. All this usually works in Asia your mileage may vary elsewhere in the world. The 'problem' really is often just overcoming the mental block of staying in a dorm or approaching a stranger to 'team up' for travelling. It doesn't always turn out to be a pleasant but it's an experience nevertheless. More often than not though it is more em fun you get stories to tell and helps reduce costs. ", "answerScore": "8", "authorUserId": "101", "authorUsername": "Mark Mayo", "downModVotes": 0, "id": 1026, "subtitle": "As solo travellers one often finds hotels charging for two beds in a room. Cruises charge a double occupancy for cabins usually. Even in hostels on a regular basis I've seen this happen if you want a private room. Bargaining works sometimes but pointing out that you'll use less electricity seems petty. What are some other tactics for keeping costs down as a solo traveller and not just for accommodation? edit I should explain hostels are fine and hostel dorms are my preferred choice by far especially for saving money and meeting people and swapping tips. But the last few cities I've been in in Central Asia just haven't had that sort of accommodation. As such I end up having to resort to a hotel and the price difference is scary But I thought this might be a useful all purpose how to save money as a solo traveller question for others as well who may not use hostels. ", "tags": "<budget><tips-and-tricks><solo-travel>", "title": "What are some strategies for keeping solo travel costs down?", "upModVotes": 8, "userId": "108", "userReputation": 30744, "username": "Ankur Banerjee", "views": 570}
