{"author_metadata": {"username": "Darren Kopp", "id": "10"}, "question_metadata": {"score": 128, "id": "10", "tags": "<safety><international-travel><money><exchange>", "views": 15857}, "text": "I think the current usual solution is to get a debit card (or failing that a credit card) with low/no foreign transaction and cash withdrawl fees. (In the UK, the Halifax Clarity Card is the best for this at the moment)\nThen, when you get to the country, take out cash periodically. Not too much in case of issues, but don't assume you can do it too often as you may not always be able to find a cash machine depending on where you are.\nIt's worth getting a little bit of currency before you go (if you don't have it left over from another trip), so you can buy a coffee while you wait for everyone who got off the plane quicker than you to finish using the cash machine at the port/airport/station!\nEdit: Since you've said you're in the US, I can't suggest the best card for you to get to avoid/minimise foreign transaction fees, but asking on the personal finance SE site is likely the best bet for finding out what that card is.\n", "question": {"subtitle": "Recently my wife and I traveled to Italy and before we left we got about 85% of our money in travelers checks and the other 15% we carried on in cash. When we arrived there, no one would take our travelers checks and many places did not accept credit cards. Eventually, we found some currency exchange places that would take the travelers checks and give us Euro's, but at a 7-15% fee, which was not really a very fun surprise. \nWhile I was under the impression that it is safer to use travelers checks, it seems that they were not really accepted (the usual explanation being fraud). So the question is, is it best to just exchange your currency at home and carry all of it with you when you travel or are there other alternatives to carrying cash that are safer and cost effective?\n", "title": "When traveling to a country with a different currency, how should you take your money?"}, "user_metadata": {"username": "Gagravarr", "reputation": 43750, "id": "26"}, "answer_metadata": {"accepted": 1, "length": 932, "score": 102, "upModVotes": 102, "downModVotes": 0, "id": "17"}, "id": "5c491f3273715c4b456b5577d780f2da"}
