{"author_metadata": {"username": "Mark Hosang", "id": "87"}, "question_metadata": {"score": 35, "id": "145", "tags": "<sightseeing><nature-and-wildlife><destinations><auroras>", "views": 1382}, "text": "I've just been in Rovaniemi, Finland a couple of weeks ago.  It's currently impossible to see the aurora as the 24-hour day is in place; obviously you need a dark sky to see it.\nHowever, Rovaniemi is just by the Arctic circle, is easy to get to (fly or train from Helsinki overnight), and is also the home of Santa Claus! \nI stayed at the Borealis Guesthouse, which should give you a clue as to what is visible from there :)\nBest times are when it's dark (obviously), so when there's a new moon is your best bet - the least light in the sky.  Check that first for dates.\nSecondly, if you have the ability to book last minute, you can sign up on twitter for Aurora storm alerts.  However this is infeasible for most, given flight costs and so on.\nRovaniemi claims to see the auroras most nights, although of course it's totally weather and solar activity dependent - you can never guarantee it.\nONE MORE option however, does practically guarantee sightings.  Kangerlussuaq in Greenland offers a 99% chance of seeing auroras between November and March, due to its very stable weather conditions.  It's where I'm planning on going next year.\nGood luck!\n", "question": {"subtitle": "I'm wondering what time of year is best, and what locations might be best, for catching the aurora.\nI'm currently thinking of February up at Sweden's ice hotel, but since the whole point of the trip is so that my wife can see the Aurora, I want to pick a location that affords the best chances to see one.\nEdit:\nJust adding a link so you can see realtime aurora activity in the northern hemisphere\nhttp://www.gi.alaska.edu/AuroraForecast/3\nI know this is anecdotal, but I ended up going to Iceland in late february during the new moon and saw the aurora 3 out of 6 nights I was there.  There was activity every single night but the biggest problem was weather.  It was cloudy almost every single night. \n", "title": "When and where do I have the highest chance of seeing auroras?"}, "user_metadata": {"username": "Mark Mayo", "reputation": 120821, "id": "101"}, "answer_metadata": {"accepted": 1, "length": 1150, "score": 21, "upModVotes": 21, "downModVotes": 0, "id": "173"}, "id": "9361b367dde9f92d8d3e3f1f72d47f7c"}
