{"accepted": 1, "answer": "Two weeks is a decent amount of time to explore Cambodia. Here are a couple of my recommendations Siem Reap strong The Angkor Wat and surrounding temples can either be covered in a day or over a couple of days. This is important because you need to buy a pass and there are passes of different durations 1 day 20 3 day 40 etc. There's a 7 day pass too but unless you're an archaeologist or a serious history nut you won't need it. Hunt around for a tuk tuk driver in the city who can speak English well don't expect that if you book through your hostel hotel they will be good. The tuk tuk driver I hired on the first day although a nice guy didn't speak any em English at all and it got incredibly frustrating when I want to deviate from his 'standard' route a bit to check out some of the other temples I was interested in. So go to the Central Market look around for drivers and negotiate. The standard rate you pay to them is 13 15 for the day. You can either pay a guide which is great for some of the smaller temples as the security guards can show you around to earn a bit on the side. At the bigger temples there are official tour guides appointed. Personally though I just bought one of the guidebooks they hawk at the temples it's called Ancient Angkor em if I remember and should cost you 6 8 you'll have to bargain . This will really help you understand some of the history behind the temples as the book has in depth information on even the smallest of temples. Do note however that currently many of the temples are going restoration work and have been for a while so you may not be able to visit all sections of the temples. One thing you should definitely strong try out though is SkyVenture a which is run jointly by a British pilot and an American archaeologist who has been living there for around 9 years and used a microlight to do ground radar scans to study the area. They take one person at a time to a tour of all the major temples from the air and as an archaeologist he tells you information about the temples things discovered from those latest ground radar scans that you won't even find in many books. They don't allow small digicams only SLRs on their flights so if you want to take pictures get one of those. Best go at sunset because the temples look really beautiful then li Battambang This isn't far from Siem Reap and the more 'scenic' journey is to go there by boat. However when I was in Cambodia this was not in operation because of something about water levels. You can either hire a tuk tuk or take a bus. I found the bamboo rail system they have there very unique very worth it. li Sihanoukville I'm not sure whether you'd like this or not. The beaches are nice however it is sort of touristy and party atmosphere like. Much less than the insanity of Thailand though and there are a couple of places that are more relaxed. li Banlung and Kratie I haven't been to these two places but there are good hiking trails near both these towns. I'm sorry I can't give more information about these two but I think you'll like them. li ul I'm not sure which airport you're flying in to probably Phnom Penh? There isn't much of 'undiscovered' stuff to do in PP and it's a fairly bustling city by Cambodian standards. The problem mostly is that the places I mentioned above often don't have direct bus connections that you can take and everything interchanges at PP the major bus operator is PP Sorya Transport . So you might find yourself having to go back although most bus journeys are no longer than 6 10 hours long. One bit that I really want to do was cross overland into Laos from Cambodia a and travel further up to Vientiane. Actually I was more interested in the Si Phan Don a 'Four Thousand Islands' although I don't think there are precisely that many in reality D which I've heard is a very laid back and beautiful place to relax in. I couldn't seem to any bus operators for that bit though very surprised by that I was told I need to go back to PP and catch a bus from there instead but for two weeks it's a less touristy place and you might like it. Also apparently they had stopped issuing visas on arrival at the land border if so you'll need to get a visa in advance which you can at Phnom Penh. ", "answerScore": "12", "authorUserId": "31", "authorUsername": "justinl", "downModVotes": 0, "id": 1062, "subtitle": "My wife and I are planning an adventure honeymoon to South East Asia in February 2012. We have our eye currently on Angkor Wat Siem Reap Cambodia . Our honeymoon will be for 2 weeks and we are interested to hear what other places in the surrounding area that are recommended as we know Angkor Wat will not take 2 weeks to see. We are up for taking a short flight or bus and crossing into other countries. We like hiking jungle tours seeing animals beaches and seeing interesting old things such as temples and ruins. We're not fans of big cities and night clubbing partying. We are both seasoned travellers. Any suggestions or small hidden gems would be highly appreciated ", "tags": "<recommendations><destinations><adventure><cambodia><siem-reap>", "title": "Recommended destinations located close to Siem Reap Cambodia", "upModVotes": 12, "userId": "108", "userReputation": 30744, "username": "Ankur Banerjee", "views": 383}
