{"author_metadata": {"username": "Michael Teper", "id": "23"}, "question_metadata": {"score": 12, "id": "9", "tags": "<sightseeing><public-transport><transportation><argentina>", "views": 1632}, "text": "In December at least it will be summer, so you can explore the entire country!\nSuggested cities and activities below:\n\nEl Calafate, Patagonia - use as a base to go see the Perito Moreno glacier - the 3rd largest in the world, and the general area - great for hiking, climbing and trekking.  The Andes are spectacular down there.\nUshuia - the end of the world, it's where the boats go to Antarctica, if you've got the cash - it's not cheap!\nIguazu Falls - these spectacular falls are about 275 individual falls on the border between Argentina and Brazil.  You CANNOT miss these.\nBuenos Aires - the home of Tango, you must see a show.  I suggest Cafe Tortoni, on Avenida de Mayo - it's cheaper than the touristy meal+dinner+lesson ads you see everywhere, and is the oldest Tango hall in the city.  Fantastic show!  Recoleta cemetery is interesting, and La Boca district - and see a football match if at all possible!\nPuerto Madryn - Wildlife bonanza - where you can watch whales from your hostel balcony, swim with seals (one of only 3 places in the world), and see many more animals on the Valdez peninsula - we saw seals, sea lions, elephant seals, whales, guanacoes, rheas, mara, armadillo, foxes, a penguin and more!\nMendoza - a wonderful place in western Argentina, it's wine country!  I could retire there tomorrow.  It has great weather, still enjoys a siesta, has some of the best wine in the world, and the steak restaurants were fantastic, as was the ice-cream!\n\nAs for getting around, bus is the easiest, safest, and most comfortable.  Three major classes - semi-cama (chairs that tilt), cama (turns to bed) and cama-suite - unbelievable.  Generally includes food (ham and cheese in semi-cama, it goes up to champagne and roasts in cama-suite), and quality depends a bit on company, but most in Argentina are fantastically comfortable, even for long distances.\nI really would recommend AGAINST renting a car.  The distances are so vast, better to just let the public transport take you there.  Perhaps, you might rent one in El Calafate to go see some of the places around there, but there are cheap tours to the glaciers and so on anyway, it's really not necessary.\nHave fun!\n", "question": {"subtitle": "We are considering visiting Argentina for up to ten days during mid-to-late December. What would be the top places to see / visit, especially during that time of year?\nSecondly, what is the best way to get around in Argentina (e.g. public transport or car rental)?\n", "title": "What are must-visit destinations for the first time trip to Argentina?"}, "user_metadata": {"username": "Mark Mayo", "reputation": 120821, "id": "101"}, "answer_metadata": {"accepted": 1, "length": 2186, "score": 19, "upModVotes": 19, "downModVotes": 0, "id": "178"}, "id": "108eb83b58e02ccc5a115ae40f4d2021"}
