{"accepted": 0, "answer": "Backdoor Jobs a is probably my favourite resource for out of the ordinary job adventures. It includes a variety of different jobs for different people with different backgrounds and experiences. A lot of the jobs listed are leading groups or hiking trekking BUT there are a lot of other ones available too. The owner writer of the site Michael Landers actually has a book a that I believe is now in its fourth edition. I purchased that book then gave it to one of my friends. It is quite the resource. Two specific opportunities that I remember from the book where working at a BioDome in I believe Arizona and sailing the Caribbean working as a crew member. The site is a good introduction to what the book has to offer. All of the organizations jobs opportunities listing in the book come with a short description and contact information. If you have the extra money I would recommend purchasing the book. PLEASE NOTE strong As a Canadian I found a lot of the opportunities were specific to American Citizens. Still I would highly recommend it for anyone as there are plenty of jobs targeting International People. ", "answerScore": "10", "authorUserId": "101", "authorUsername": "Mark Mayo", "downModVotes": 0, "id": 1160, "subtitle": "I've come across a few travel working websites which can get you a 'non standard' job in a remote place like EscapeTheCity a which has had roles from post office master in Antarctica to landmine defuser to chocolate taster. I'm looking for 'something' preferably in Latin America ideally travel related and I'm struggling to find work travel websites that aren't just 'volunteer tourism' where you end up paying to do it. I currently work as a software contractor but given my explosion of interest in travel the last few years and having done some fairly hard travel have some experience of that. Hiking trekking guide no don't have the physical ability to lead something like that. But working with animals sure leading tours sure teaching English in the jungle sure that also could be interesting. But something related to tours organising leading researching or travelling ahead to prepare for the group would be my ideal short term goal for a role. These are however kinda non standard and not that often advertised for. Any travel working resources would be of interest. This could probably be a community wiki too. ", "tags": "<online-resources><work><south-america><central-america><mexico>", "title": "Website resources for 'out there' jobs related to travel", "upModVotes": 10, "userId": "8", "userReputation": 1191, "username": "Seanland", "views": 337}
