{"accepted": 1, "answer": "The situation is very complicated. Georgia says that Abkhazia and South Ossetia are Georgian territories and you can go there from Georgia by this border crossing to South Ossetia from Gori a my friends from Germany made a trip this year. li ul If you get into these territories not by these points you would get problems fee from 1200 or jail up to 5 years during next visit to Georgia according to Georgian law a sorry only in russian because you'll get stamps from Abkhazia and South Ossetia. You can only try to get new passport before visiting the Georgia. strong From Russia you can visit these territories by this border crossing to South Ossetia via Roki Tunnel a li ul There is not much problem to get a visa from South Ossetia consulate in Moscow a ", "answerScore": "10", "authorUserId": "140", "authorUsername": "hippietrail", "downModVotes": 0, "id": 1066, "subtitle": "South Ossetia is a rebel provice of the Republic of Georgia recognized and supported by Russia as an independent state since 2008 but recognized by most countries in the world as part of the Republic of Georgia. Last I heard the situation was a bit different to that in Abkhazia which I believe can be visited somehow. a I heard that in the case of South Ossetia you cannot visit from Russia North Ossetia unless you are a citizen of a CIS country and that you cannot visit from Georgia at all. Is this still the case in November 2011? Can I visit as foreign tourist either from Georgia or Russia and if so what visas permits paperwork will I need? If I can visit from Russia but not from Georgia will I have trouble subsequently visiting Georgia with a South Ossetia passport stamp? P.S. strong I'm not asking about whether any western country issues travel advisories asking me not to visit. I'm aware it's unstable to some degree or other. If there are documented killings or kidnappings of western tourists in the last year that may be relevant however. ", "tags": "<russia><georgia-country><disputed-territories><war-zones>", "title": "Is it possible for a tourist to visit South Ossetia?", "upModVotes": 10, "userId": "19", "userReputation": 17190, "username": "VMAtm", "views": 1370}
