{"accepted": 1, "answer": "I find several things help some are physical or physiological while others are purely mental I find it easier to adjust to it's morning get up now as you get when you fly east if I get light on my face as soon as possible. On the plane open your shade eat the breakfast they give you and do the things you do in the morning. In a hotel get those curtains open. Go for a little walk outside before breakfast. li change your watch to destination time. Do not say or allow others to say that it's really 3am or that your body thinks it's 3am or anything other than the time it is where you are li Eat when you're hungry regardless of the clock but sleep drink coffee drink alcohol and watch TV only according to what the clock says is ok where you are li Sleep on the plane. Even for a four hour flight and even in the middle of the day it's boring after all and getting a little extra sleep is bound to help with tiredness later. This is especially important when flying west since you'll need to stay up late. And when you wake up even if there's lots of flight remaining switch to destination time. Treat the asleep time as the transition. li Drink lots of fluids. Flying is dehydrating jetlag makes you grumpy and headachy and waiting until the appropriate time for a meal can mean getting thirsty. Have water or other non caffeine non alcohol drinks a little more often than you otherwise would. li If you know that jetlag hits you hard arrange your schedule for the first few days of your trip to be low key. A long train ride with plenty of staring out the window could be boring but if you're tired and adjusting to the time shift it's way better than being on stage giving a make or break presentation. If you give yourself a day or two for jetlag transition don't take those days back by leaving vital work like rehearsing the talk for then. Same for when you come home. li Bring something to occupy yourself if you wake up long before your travelling companions. Ideally you could read or do email for 30 minutes then go back to sleep. li ul Don't take it as a sign of weakness if you get hit hard by jetlag. Some do and some don't. But there are things you can do that help. ", "answerScore": "54", "authorUserId": "101", "authorUsername": "Mark Mayo", "downModVotes": 1, "id": 1020, "subtitle": "From my personal anecdotal experience I've found it worse when travelling east around the globe. I also tend to stay awake most if not all of the flight so sleeping time doesn't tend to matter as the flights from London to NZ are minimum 28 hours. Shorter flights you can arrange around daylight hours to reduce this but otherwise there must be better strategies to help out with. UPDATE So I was fine despite nearly 48 hours of non sleep from Mongolia to London up the next 3 days at 8am to do stuff. However the second em week has been awful sleepless nights and erratic sleepiness. Any theories? Also see How do you prepare for long haul flights? a em strong ", "tags": "<air-travel><health><tips-and-tricks><long-haul><jet-lag>", "title": "How can I avoid or minimize jet lag?", "upModVotes": 55, "userId": "46", "userReputation": 47794, "username": "Kate Gregory", "views": 4240}
