{"author_metadata": {"username": "Darren Kopp", "id": "10"}, "question_metadata": {"score": 128, "id": "10", "tags": "<safety><international-travel><money><exchange>", "views": 15857}, "text": "It really depends not only on where you are going but also from where you are coming. I usually carry with me enough money to pay for everything I need on the first 3 days. The rest of my money I try to get with my credit cards and I usually try to carry two of them.\nAlways try to pay for hotel, car and other similar before you start your trip. In this case, at least, you will be able to sleep the first night.\nTry to get the money in the country currency instead of in an intermediate currency to avoid double fees. Also, try to not do your money exchange in the airport. If possible, not even in your hotel. These are the two who charge highest fees.\nMost of the US credit/debit cards are not the so called \"smart cards\" or \"card with chip\". This was an issue for me in some places in France back in 2004, when I could not buy some last minute souvenirs.\nI also try to not get money back from the country. Usually I try to spend all of them but, if I could not, I try to pay for some incidentals in the hotel using this money. You can always try to pay part of your hotel with local cash and part with a credit card if you have not payed in advance.\n", "question": {"subtitle": "Recently my wife and I traveled to Italy and before we left we got about 85% of our money in travelers checks and the other 15% we carried on in cash. When we arrived there, no one would take our travelers checks and many places did not accept credit cards. Eventually, we found some currency exchange places that would take the travelers checks and give us Euro's, but at a 7-15% fee, which was not really a very fun surprise. \nWhile I was under the impression that it is safer to use travelers checks, it seems that they were not really accepted (the usual explanation being fraud). So the question is, is it best to just exchange your currency at home and carry all of it with you when you travel or are there other alternatives to carrying cash that are safer and cost effective?\n", "title": "When traveling to a country with a different currency, how should you take your money?"}, "user_metadata": {"username": "Rodolfo", "reputation": 1142, "id": "40"}, "answer_metadata": {"accepted": 0, "length": 1155, "score": 16, "upModVotes": 16, "downModVotes": 0, "id": "36"}, "id": "09f0262cf9bf91c7d96a33cbf32c53dc"}
