{"author_metadata": {"username": "Raj More", "id": "33"}, "question_metadata": {"score": 4, "id": "135", "tags": "<safety><international-travel>", "views": 292}, "text": "Secure your valuables.\nThis doesn't mean \"wear one of those naff money belts\". Your ID, credit cards and driver's license are not secure and not necessary if they're on you while you're walking around - take only the cash you need with you, and leave everything else at the place you're staying. If you do get robbed or pickpocketed, your loss is minimized. Consider keeping a copy of your passport page on you at all times, in case you are robbed or it is stolen from your luggage.\nYou should either stay at a hotel/hostel with a good reputation (look online) to ensure your belongings are not tampered with while you're out, or alternately stay at a place that provides lockers, or secure your luggage to a fixed piece of furniture (wardrobe rail, bed, desk) using a cable lock and luggage net if required. To eliminate the need for the luggage net, you can buy slash-proof backpacks nowadays. It is far easier to stay in a place with a good reputation (and/or lockers) than doing all of this, though.\n", "question": {"subtitle": "Most people in first world countries have a very different idea of \"safe\".  First world country houses do not have bars on the windows, the yard may not even have a fence, a hotel that looks good from outside is usually a good bet inside.  Most protection mechanisms are intended to keep the honest person honest.\nWhen such people travel into the a third-world country, their parameters of \"safe\" need probably to be a adjusted little bit.\nWhat are some of the safety related changes one one should be be congnizant of when traveling to a third world-country?\n", "title": "Being safe in an unknown place"}, "user_metadata": {"username": "jozzas", "reputation": 2219, "id": "65"}, "answer_metadata": {"accepted": 0, "length": 1004, "score": 6, "upModVotes": 6, "downModVotes": 0, "id": "139"}, "id": "1f5ae790d1062063e0751b30c0b05c2a"}
