{"accepted": 1, "answer": " From Tbilisi to Baku you can go via train 38 37 a . It goes every day so there is no problem with that. li From Baku you can get to Aktau Kazakhstan via ferry a . People who used this ferry are saying it has no stable schedule so you can contact ferry station by phone a li ul 99412 493 19 63 99412 498 10 13 blockquote Also you can go to Trkmenbay Turkmenistan a if you want it much closer but I can't find info about transit visa for Turkmenistan. li From Aktau you can get to Almaty a by train 377 a . li From there you can pass to one of the main border crossing points Dostyk a by train 114 a and even to rmqi China a by train 014 a since in Almaty there is a Chinese embassy . li rmqi is a large rail point in North China but the only two points to cross the China Mongolia border is Zamyn d a and Erenhot a so you need get a train to one of these points. li ul ", "answerScore": "10", "authorUserId": "140", "authorUsername": "hippietrail", "downModVotes": 0, "id": 1046, "subtitle": "I plan to base myself in the Replubic of Georgia for a while and I'm thinking of a trip from there to Mongolia but I have some restrictions No flying overland is more of an adventure li I can't enter Russia I can't get a Russian visa outside my home country li ul So I can get to Azerbaijan and cross the Caspian or into Iran without too much trouble as far as I know. But then things get tricky. Turkmenistan is probably out. Kazakhstan looks like the obvious answer but there's about 50km between where Kazakhstan ends and Mongolia begins with just a Russia China border. So are there ways to travel this section? Roads? Border crossings? And if not which other overland route from the Caucasus to Mongolia without Russia is more possible? ", "tags": "<china><overland><caucasus><mongolia><central-asia>", "title": "Overland route from the Caucasus to Mongolia without entering Russia?", "upModVotes": 10, "userId": "19", "userReputation": 17190, "username": "VMAtm", "views": 462}
