{"accepted": 1, "answer": "The situation is very complicated. Georgia says that Abkhazia and South Ossetia are Georgian territories and you can go there from Georgia by this border crossing to Abkhazia from Zugdidi a my friends from Germany made such trip this year. But they say that they got some local help for the border crossing because Abkhazia trying to close the border to stop the Georgian spies. li ul My frieds made a trip into the Georgia to visit this territories. Georgian liked fact that they didn't hide this plans from officials. As for the stamps in passports they made a deal with rebel provinces officials not to stamp the passport but some paper instead of it. em If you get into these territories not by these points you would have some problems fee from 1200 or jail up to 5 years during your next visit to Georgia according to Georgian law a sorry only in russian because you'll get stamps from Abkhazia and South Ossetia. You can only try to get new passport before visiting the Georgia. strong From Russia you can visit these territories by this border crossing to Abkhazia via Adler Sukhumi a highway or by train 627 a from Adler. li ul There is not much problem to get a visa from Abkhazia consulate in Moscow a See also official website a ", "answerScore": "11", "authorUserId": "140", "authorUsername": "hippietrail", "downModVotes": 0, "id": 1065, "subtitle": "Is it possible currently November 2011 to visit the rebel province of Abkhazia from the rest of the Republic of Georgia? Russia regards it as independent since 2008 but most or all other countries regard it as still part of Georgia I had heard that it was not allowed by the Georgian government and that soldiers would actively prevent anyone trying to do so. But that was a while ago and things can and do change quickly and this is not a part of the world where such news quickly becomes known in western countries. So can I now enter from Georgia and if so what kind of visa permit would be needed? If not I assume I can visit from Russia with of course a Russian visa but would I need any other kind of paperwork. And would Georgia let me back in with an Abkhazia stamp in my passport? See also my similar but not identical question about South Ossetia a PS strong I'm not asking about whether any western country issues travel advisories asking me not to visit. I'm aware it's unstable to some degree or other. If there are documented killings or kidnappings of western tourists in the last year that may be relevant however. ", "tags": "<georgia-country><borders><caucasus><disputed-territories>", "title": "Is it possible to visit Abkhazia by land from Georgia?", "upModVotes": 11, "userId": "19", "userReputation": 17190, "username": "VMAtm", "views": 1613}
