{"author_metadata": {"username": "justinl", "id": "31"}, "question_metadata": {"score": 13, "id": "86", "tags": "<tours><guides><vietnam><hanoi>", "views": 2026}, "text": "My experience with Vietnam was that it really didn't matter - there are literally hundreds of travel agencies and many of them share the same tour operators. You get picked up at the travel agency you booked at and the bus continues on to 5-10 other places to pick up everyone else. The only thing you really need consider is the price (which shouldn't vary by much anyway).\nIf you're really concerned about getting ripped off (unlikely), I would wait until you arrive, and just ask some recently returned travelers who they booked with and whether they would recommend them. You may even get a (small) discount if you say you were referred by someone else.\nFor Ha Long Bay, most tour operators will recommend a 1-2 night tour, with one night on Cat Ba Island and one on a Vietnamese junk (tourist boat). For what it's worth, I thoroughly enjoyed both. Be warned that a junk recently sank during the night killing a few tourists, so be a bit more wary of spending a night on one.  \nSimilarly with Sapa, tour operators will recommend you do some trekking with/to meet the local Hmong tribes, this I would also thoroughly recommend. Don't forget to bring some decent hiking boots (or buy them in Hanoi) as it's always muddy. After the hike you can get your boots cleaned and dried in 20 minutes for about a dollar. I have no idea how they do it.\nTours are very easy to organise from Hanoi but keep in mind if you're going far afield it can take a very long time due to the condition of the roads and the fact that speeds are limited due to motorbikes/pigs/chickens/people sharing them with you. This shouldn't be a concern with what you're interested in, but something to keep in mind if plans change.\n", "question": {"subtitle": "I am travelling to Vietnam in December and would like to book with a travel agency in the Hanoi area.  There are so many to choose from, what are things that I should consider when picking a travel agency (additionally to avoid getting ripped off).\n", "title": "How do I choose a travel agency to book tours from in Hanoi, Vietnam?"}, "user_metadata": {"username": "jozzas", "reputation": 2219, "id": "65"}, "answer_metadata": {"accepted": 1, "length": 1700, "score": 13, "upModVotes": 13, "downModVotes": 0, "id": "103"}, "id": "15a70d827ba9a592ec12a7aa8fb2b33d"}
