{"author_metadata": {"username": "Phelios", "id": "88"}, "question_metadata": {"score": 8, "id": "154", "tags": "<safety><security>", "views": 412}, "text": "Jozza'a quote above is on so many of the 'crazy' travellers' Facebook profiles that I encounter.  I'm in southern Russia at present after a 34 hour train journey, and I'm trying to work out how to get into Kazakhstan.  I don't speak the language, don't know where I'm going, and am on my own.  And you know what? I haven't had any problems, no crime, the train runs fine (exactly to time), and in general people are friendly and helpful, even if you can't understand each other.\nA friend cycled from London to New Zealand over 20 months.  She was on her own cycling through places like Iran, Afghanistan, India - all 'hard' countries, some very scary.  Again, she was fine.  She had some scares, sure, but in general she made it through with amazing stories.\nMy personal quote is that as long as you survive a bad experience, it makes a great story and adds to your character.\nAnother friend (who I'm currently chasing) is in Uzbekistan.  He's riding a 85cc scooter from London to Mongolia.  He's crashed, broken down, lost parts - and people have welded his scooter together for nothing, hunted out spare parts for him, and always refused to take money - they're happy to help out of the goodness of their hearts.\nIt's something you start to realise - every country has some crime, some bad people.  But if you're careful, in GENERAL, people everywhere are basically good, and happy to help a fellow human being.  \nDon't be scared, be cautious.  It's a fantastic world out there - it's scary, but it's exciting.  Go explore it!\n", "question": {"subtitle": "Places like India, Thailand or some African countries are sometimes contain risks for travellers. It probably will be fine if we stay in the main town area, but some interesting places to visits are really creepy when viewed from TV.\nSome dangerous activities will include hiking, diving or camping.\nSo, when thinking of visiting or doing them, there is always fear of anything might happen such as kidnapping, getting lost, hostile citizens/villagers, crimes, shark attack, jelly fish attack, accidents and so on. Therefore, I only will visit places that is already proven really safe and convenient.\nI really want to do it sometimes. Any suggestion to fight the fear?\n", "title": "Hodophobia ... Scared of doing things or going to places that is dangerous"}, "user_metadata": {"username": "Mark Mayo", "reputation": 120821, "id": "101"}, "answer_metadata": {"accepted": 1, "length": 1529, "score": 16, "upModVotes": 16, "downModVotes": 0, "id": "171"}, "id": "e8b7dc2813b345bca608dd98ff954c48"}
