{"author_metadata": {"username": "Darren Kopp", "id": "10"}, "question_metadata": {"score": 128, "id": "10", "tags": "<safety><international-travel><money><exchange>", "views": 15857}, "text": "Credit Cards are a fairly safe method, when they are accepted. Note, however, that save for very few credit cards, the vast majority will charge you a conversion fee on each transaction (around 2%-5%).\nUsing a debit card, and taking out money at an ATM when needed, is another alternative (although you again may be limited by the ATM network). There are also fees, but usually not as dire as the dedicated exchanges.\nYou may also find that banks that are off the tourist traps will give better exchange rates.\nFrom my experience, when traveling in a first world country, you are safe taking about 20% in cash, for incidentals, filling in the rest with debit withdrawals and credit cards, as available.\nBe sure to call your credit card company and your bank before you leave and let them know your dates of travel. It will save you uncomfortable moments in front of an ATM or in a restaurant when your transaction is denied.\nFinally, be aware of your debit card daily and one-time withdrawal limits. Because of the fees, you may well want to withdraw up to the max, and if your max is too low, and if you can only withdraw up to that max once a day, your access to cash may be restricted. When you are calling your bank, also inquire about these limits, and see if you can have them raised, if necessary.\n", "question": {"subtitle": "Recently my wife and I traveled to Italy and before we left we got about 85% of our money in travelers checks and the other 15% we carried on in cash. When we arrived there, no one would take our travelers checks and many places did not accept credit cards. Eventually, we found some currency exchange places that would take the travelers checks and give us Euro's, but at a 7-15% fee, which was not really a very fun surprise. \nWhile I was under the impression that it is safer to use travelers checks, it seems that they were not really accepted (the usual explanation being fraud). So the question is, is it best to just exchange your currency at home and carry all of it with you when you travel or are there other alternatives to carrying cash that are safer and cost effective?\n", "title": "When traveling to a country with a different currency, how should you take your money?"}, "user_metadata": {"username": "Michael Teper", "reputation": 768, "id": "23"}, "answer_metadata": {"accepted": 0, "length": 1305, "score": 15, "upModVotes": 15, "downModVotes": 0, "id": "24"}, "id": "72dc3bbe21a4d92637f0ece392d029e9"}
