{"author_metadata": {"username": "NicoleC", "id": "28"}, "question_metadata": {"score": 13, "id": "34", "tags": "<planning><tropical-destinations>", "views": 433}, "text": "Tropical destinations do not split the year in 4 seasons, they usually have only 2: rain and dry seasons. Day and night are almost the same size all the year. Look for pictures on the web first and them try to find some local deals even with big sites like Expedia (e.g: look for vacation packages and see what they offer).\nIf you are going to a very different place, try to act as a local there. This is really a better option than acting as a tourist. Eat, travel and live as a local. This is the best advice I can give to you.\n", "question": {"subtitle": "Tropical destinations have to be one of the most popular categories, which means there are always deals popping up, so it's hard not to be driven by these deals.\nIf I'm merely looking at the destination, and not the deals to be had, how do I find out which tropical destination has the attributes that are most desirable to me?\nI need help even knowing what questions to ask, but a few which come to mind are:\n\nWhat is the hiking like nearby?\nWhat is the average wind speed like?\nWhat type of beaches are available (surfing, sunbathing, secluded, scenic)\nWhat is the water like? (Clear and calm, strong swell, covered with seaweed, etc.)\nIs the water good for swimming? (Counter-example: we took a trip to Broome, Western Australia and found out that basically one shouldn't swim at all during the time of year we were there due to jellyfish/stinger threats)\n\nAnd once I know what questions to ask about the destination, what is the best method of finding a good match?\n", "title": "What kind of questions should I be asking about tropical destinations?"}, "user_metadata": {"username": "Rodolfo", "reputation": 1142, "id": "40"}, "answer_metadata": {"accepted": 0, "length": 530, "score": 7, "upModVotes": 8, "downModVotes": 1, "id": "43"}, "id": "2cce085ff699bf82d85cf098ae28cbbe"}
