{"accepted": 1, "answer": "You can find information about train stations in France on the Gares en Mouvement Stations in Motion a web site. The translation is somewhat haphazard. A left luggage facility is called a consigne em consigne automatique em for automated lockers or consigne manuelle em if there's an attendant . In Paris Nord a there are both automated lockers acessible as long as the station is open i.e. 4 301 00 and a left luggage office open daily 6 1523 15 . They are on the underground level near the taxi rank which means they're very close to the exit from the Eurostar platforms. Paris Nord isn't very big anyway once you've walked to the front of the train which can be about 400m. ", "answerScore": "13", "authorUserId": "26", "authorUsername": "Gagravarr", "downModVotes": 0, "id": 1170, "subtitle": "I know that most big railway stations in Europe are civilised and have left luggage facilities. Before I plan part of my day in Paris around it being available though I thought it was worth checking. Does anyone know if there is a left luggage facility available at Paris Gare du Nord station? Assuming so what kind is it? Is it like the one in Milan where there's a staffed left luggage counter on the station concourse and you need to be aware that it closes? Or is it like Brussels Midi where there are just a load of large lockers in racks? Hiding round the corner on the way to platforms 3 6 if you're looking for them Or perhaps even like Cologne Kln where there is a nifty underground robotic thingy where you can drop off or collect your bags from any of the locker like units? Oh and if there is one is it anywhere near the Eurostar platforms or am I looking at walking half way back to England to find it on the other side of the huge station...? ", "tags": "<france><luggage><trains><high-speed-rail><paris>", "title": "Left Luggage facilities at Paris Gare du Nord?", "upModVotes": 13, "userId": "277", "userReputation": 12888, "username": "Gilles", "views": 5877}
