{"accepted": 1, "answer": "Wow interesting question. Nature wise there's SO much to see in Ireland Cliffs of Moher Giant's Causeway the Dingle Peninsula. There's sights from Blarney Castle to the amazing history and sights of Belfast. However if you're after things specifically that children may enjoy 'history' stuff is probably out I'd suggest the following to include in your itinerary 1 Dingle Peninsula as well as being a beautiful place and a charming town you can look for Fungie Dingle's resident dolphin. And if you can't find him his statue is down by the boats as well 2 Giant's Causeway a spectacular place with over 40 000 columns of basalt rock it'd be fun for kids to climb all over as well. 3 The Exploris Aquarium in Northern Ireland http www.northern ireland travel.com exploris aquarium.html a 4 Belfast the night time Black Cab tours sure the history won't mean much to the kids but Black Cabs can be a fun and different vehicle to ride in. And it's a brilliant tour for adults 5 Blarney Castle castles are fun for everyone and you get to hang off the top and kiss the Blarney stone 6 The Cliffs of Moher can't be skipped absolutely spectacular Plus when you see the Cliffs of Insanity in The Princess Bride you'll be able to say you've been there Finally if you're after some places to eat and stay that are kids friendly http www.ireland guide.com ten of the best for kids.5831.html a ", "answerScore": "11", "authorUserId": "44", "authorUsername": "Grzenio", "downModVotes": 0, "id": 1036, "subtitle": "I am planning a visit with my daughter 2 years and wife around Ireland and Northern Ireland for ten days. We start from Cork and finish in Dublin. What are the most interesting places to visit? In particular we are not interested in stuff not suitable for children night life etc and we would prefer to see something different from that in the UK and the rest of Europe. We have a Rough Guide but I found it almost impossible to figure out what is really worth seeing. I would be grateful for any suggestions. EDIT Regarding historic sites usually mostly outdoor sites are OK it's just the museum type sightseeing is too boring for the little one. ", "tags": "<planning><children><ireland><northern-ireland>", "title": "What are Ireland's top places to visit with a toddler?", "upModVotes": 11, "userId": "101", "userReputation": 121308, "username": "Mark Mayo", "views": 2115}
