{"accepted": 0, "answer": "Unless the car is over 25 years old it's very difficult to import a car into the US. Check out this article for some details Importing Rare Cars into the US a If it's newer it has to meet Department of Transportation and EPA guidelines. California used to charge a 300 smog fee for a car brought in from another state unless it had a special California sticker. You will also have register and get insurance for the car. You may be better off buying a car in the US and then selling it when you leave like the Top Gear guys did in this episode Top Gear USA Road Trip a Here's the official word from Customs and Border Patrol Importing a Motor Vehicle a Ah ha there is this exception Nonresidents may import a vehicle duty free for personal use up to 1 one year if the vehicle is imported in conjunction with the owners arrival. Vehicles imported under this provision that do not conform to U.S. safety and emission standards must be exported within one year and may not be sold in the U.S. There is no exemption or extension of the export requirements. ", "answerScore": "15", "authorUserId": "248", "authorUsername": "Jacco", "downModVotes": 2, "id": 1058, "subtitle": "The plan is to drive my car a small 4x4 a from Prudhoe Bay a 1 sup Deadhorse a Alaska to Cape Horn a Tierra del Fuego a in Chile. I will be travelling for an undetermined duration with a minimum of two years. I know it can be done a lot faster but it's about the journey the destination is just an excuse . We will leave in the first week of January 2013. For various reasons I've decided to bring my own car. So I'll need to ship it from Europe to Canada. My questions are strong Has anybody shipped a car between Europe and Canada or the U.S.? li What kind of cost am I looking at? li Any gotchas I need to know about? li ul Quick Update strong I'll be shipping from wherever is the cheapest option in Europe mainland and shipping to the cheapest option in Canada or the U.S. Extra Information strong Many people suggested buying a car in either Canada or Alaska. But that does not answer the question I was asking The car has some very nice base characteristics very small very good off road ability cheap and in addition has special modifications for long range independent travel such as but not limited to extended fuel and water tanks and in addition I know this car's history so I can make an informed estimate about it's reliability. So I've decided to bring this car em . The question is now what's the best cheapest option to ship it. I will likely not em re register the car in the U.S. nor Canada. I've heard from several travellers that it increases hassle if your car is registered in a different country than you live in so for now the plan is to keep the car registered in my home country. 1 sup I Actually wanted to go to Barrow a but it turn out the 200 miles between there and Deadhorse are an expedition in itself a sub . ", "tags": "<canada><europe><automobiles><shipping>", "title": "Shipping my car from Europe to Canada or the U.S", "upModVotes": 17, "userId": "465", "userReputation": 4144, "username": "mkennedy", "views": 23848}
