{"accepted": 0, "answer": "If only need a OV chipkaart for the train you don't actually need one. You can just order the train tickets online a and print at home on paper. If you need it for the buses metro and tram you indeed need to charge it. Personally I have a OV chipkaart which is connected to my train reduction card. For about 50 euros per year you get 40 discount on all train journey outside peak hours. This reduction card does also contain an OV chipkaart which you can upload at train stations. At the main stations you can charge with major credit cards. You need to look for the yellow blue automatic vending machines that contain large touch screens. I am not sure if they accept all OV chipkaarts or only those connected to a NS reduction card. According to the OV chipkaart a website they offer online charging. It is a bit of hassle though. First you need to buy credit online then you need to find the closest charging device to load your credit to your personal card. Since the English page is only partially translated here is a dictionary to understand the website. Profiteer van het gemak van reizen op saldo Profit from the ease of traveling with credit strong Ease? Yeah right Aan het begin van uw reis checkt u in aan het einde checkt u uit At the beginning of your journey you check in at the end you check out strong De reiskosten worden automatisch berekend en van het saldo van uw OV chipkaart afgeschreven The cost of your journey will be charged to your card strong Het toegestane saldo op uw OV chipkaart bedraagt maximaal 150 You can charge up to 150 strong Bestellen Order strong blockquote If you have the time could you please file a complaint about the lack of a proper translation? I just checked with a foreign friend. The OV charging machines accept V pay and maestro. ", "answerScore": "11", "authorUserId": "277", "authorUsername": "Gilles", "downModVotes": 0, "id": 1028, "subtitle": "I have an anonymous OV chipkaart a Dutch public transport electronic card . I don't have a Dutch banking card. In other words I'm a foreigner who goes to the Netherlands occasionally. What are my options to recharge the OV chipkaart either with cash ideally banknotes or with a credit card? Would getting a nominative card enable me to recharge it through the website without a Dutch banking card? ", "tags": "<public-transport><tickets><payment-cards><netherlands>", "title": "Is it possible to recharge an OV chipkaart without a Dutch banking card?", "upModVotes": 11, "userId": null, "userReputation": 0, "username": 0, "views": 7410}
