{"accepted": 1, "answer": "Ask for the cheapest room . You may be surprised. If I can't find a hostel or a cheapie hotel and have to stay at a regular tourist hotel I will find the cheapest one and then ask for the cheapest room. I once had to do this in Regensburg Bavaria. When I said Der billigste Zimmer in my terrible German the check in man looked up at from behind his glasses and repeated what I had said. It turned out they had this one bizarre half room just big enough for a single bed and with an odd non matching door. I can't remember exactly but it was something like 20 euro instead of 50 euro and still included breakfast. Other places when they are not full will offer you a discount when you ask this and yet others will tell you something like if you really want the cheapest place you might want to try this other place and often warn you that it's in a dodgy area. Another thing I've done a couple of times looking for a cheap bed is bump into another traveller looking for a cheap bed. With two of us we can find a hotel with a twin room two separate beds . This worked for me in Batumi Georgia last year and in Brunei years ago. Do you also want tips not for private rooms? ", "answerScore": "11", "authorUserId": "101", "authorUsername": "Mark Mayo", "downModVotes": 0, "id": 1027, "subtitle": "As solo travellers one often finds hotels charging for two beds in a room. Cruises charge a double occupancy for cabins usually. Even in hostels on a regular basis I've seen this happen if you want a private room. Bargaining works sometimes but pointing out that you'll use less electricity seems petty. What are some other tactics for keeping costs down as a solo traveller and not just for accommodation? edit I should explain hostels are fine and hostel dorms are my preferred choice by far especially for saving money and meeting people and swapping tips. But the last few cities I've been in in Central Asia just haven't had that sort of accommodation. As such I end up having to resort to a hotel and the price difference is scary But I thought this might be a useful all purpose how to save money as a solo traveller question for others as well who may not use hostels. ", "tags": "<budget><tips-and-tricks><solo-travel>", "title": "What are some strategies for keeping solo travel costs down?", "upModVotes": 11, "userId": "140", "userReputation": 42267, "username": "hippietrail", "views": 570}
