{"accepted": 0, "answer": "This is not something I have done personally but I recently sat on a 13 hour flight next to a family that had 2 children. One was under the age of 2 years old and the other I'd say was 3 4. Our seats were at the very front of the section so we had a little extra leg room and no one sat in front of us. This allowed the family to put blankets down on the floor and the child laid down on the floor for some portions of the flight when the seat belt sign was not active. For most of the flight the child slept and was fairly quiet. I'd imagine this was dependant on the child though. Each child I would imagine would handle the situation differently. UPDATE strong I just completed a 13 hour flight China Airlines with my wife and 1 year old boy. We hadn't bought him his own seat to save money. Because we were flying with a child we were able to book the very front seats of the section so we had extra leg room. Also because it was the 2 seats on the side of the aircraft it made it easier because I sat in the aisle and basically blocked our son from escaping out of the little area we had made by putting my legs out. 2 things that made the flight much easier were that we brought a full sized bed pillow and a large soft blanket. The pillow was placed on my wife or I's lap and if our son wanted to sleep he could sleep on the pillow instead of our uncomfortable legs. We placed the large soft blanked on the floor where our feet were. This made the little play area much nicer to crawl on and some time in the middle of the flight our son slept on the floor for a good 5 hours. To help him sleep on the floor we draped another blanket one of the blankets provided by the airline over top of him to essentially make a little dark fort to sleep in. It worked great. ", "answerScore": "10", "authorUserId": "43", "authorUsername": "theycallmemorty", "downModVotes": 0, "id": 1082, "subtitle": "What is the best way to approach a long 8 hours flight with a young child 1 2 years old ? It seems I am not required to purchase a seat for a child under two years of age which would save some money. But is that actually advisable? It seems it would be convenient to put the child in his own seat rather than being forced to hold him for hours in an already cramped environment. ", "tags": "<air-travel><health><children><long-haul><seating>", "title": "Do infants need their own seats on long flights?", "upModVotes": 10, "userId": "31", "userReputation": 1377, "username": "justinl", "views": 2874}
