{"author_metadata": {"username": "Darren Kopp", "id": "10"}, "question_metadata": {"score": 128, "id": "10", "tags": "<safety><international-travel><money><exchange>", "views": 15857}, "text": "My answer is Europe centric:\nWe are used to banks in the USA that will give you a debit or check card with a magnetic stripe. Credit cards are the same way. Some of these credit cards have a chip and almost none of them require a pin when used as a credit card.\nOn the other hand, when you fly / sail / swim across the pond to Europe, almost every local card has a Chip and a Pin.\nMost European stores will accept US credit cards.  I was able to buy food, grocery, etc. using my USA credit cards.\nTicket vending machines for trains or buses, other automated machines, small merchants, etc. will require the Chip and Pin. Lack of Chip and Pin what had me waiting in line to buy a ticket for 80 min at Gare du Nord in Paris, and barely caught my train.\nNow defunct: The Travelex Cash Passport, which is chip-and-pin protected is a good idea, but it costs a lot. If you load it in small increments, they can charge you just about 14%.\nYou can also open an overseas account, but I have heard that such an account is usually considered a red-flag for an IRS audit.\nRead this very enlightening thread started by Joel Spolsky.\n", "question": {"subtitle": "Recently my wife and I traveled to Italy and before we left we got about 85% of our money in travelers checks and the other 15% we carried on in cash. When we arrived there, no one would take our travelers checks and many places did not accept credit cards. Eventually, we found some currency exchange places that would take the travelers checks and give us Euro's, but at a 7-15% fee, which was not really a very fun surprise. \nWhile I was under the impression that it is safer to use travelers checks, it seems that they were not really accepted (the usual explanation being fraud). So the question is, is it best to just exchange your currency at home and carry all of it with you when you travel or are there other alternatives to carrying cash that are safer and cost effective?\n", "title": "When traveling to a country with a different currency, how should you take your money?"}, "user_metadata": {"username": "Raj More", "reputation": 1656, "id": "33"}, "answer_metadata": {"accepted": 0, "length": 1120, "score": 26, "upModVotes": 26, "downModVotes": 0, "id": "134"}, "id": "e72a137bc283977413a4a14156d0e2d2"}
