{"author_metadata": {"username": "Jan", "id": "34"}, "question_metadata": {"score": 10, "id": "33", "tags": "<online-resources><international-travel><adventure><extreme-tourism><islands>", "views": 214}, "text": "I suspect the only way to get to some of these places is by ship - neither of those you mentioned have any form of airstrip. I've only found one way to get to the Kerguelen islands, via a French tour operator, but it costs 15,000 Euros for the 28 day voyage.  Working on a private sailing yacht that intend to visit one of these islands might be a better bet. Look at the Jamestown, St. Helena harbour on Google Maps, for example:\n\nI'd say you're more likely to get there by sailing adventure than by cruise or cargo ship. You can earn your keep on a sailing yacht by working as a crew member, and there are many good sites for finding yachts, including:\nhttp://www.findacrew.net/\nhttp://www.crewfile.com\nhttp://www.crewseekers.net\nAs luck would have it, I wondered what the larger ship at the top of that picture of Jamestown harbour was, turns out it's the RMS St. Helena, a Royal Mail Postal ship. You can ride as a passenger from Cape Town, South Africa to St. Helena, and this looks to be the most trafficked way of getting there as a tourist. It doesn't look to be too expensive, either (A couple of thousand pounds rather than 15,000 Euros). Do note that the prices are in GBP.\nSt. Helena also has an official tourism site with a \"how to get there\" section. Most places with permanent residents will likely have a web presence of some kind.\nAnyone wanting to visit St. Helena more quickly / cheaply / with less seasickness should note that they are also building an airport.\n", "question": {"subtitle": "I'm dreaming of visiting remote islands such as St. Helena or the Kerguelen islands, but mostly don't get past the dreaming stage because I don't really know how to start making it happen. I think exchanging information and experiences with like-minded people would help me get started. Are there any special-interest communities or online resources that deal specifically with that topic?\n", "title": "Online resources/communities especially for travelling to remote islands"}, "user_metadata": {"username": "jozzas", "reputation": 2219, "id": "65"}, "answer_metadata": {"accepted": 0, "length": 1482, "score": 3, "upModVotes": 3, "downModVotes": 0, "id": "133"}, "id": "1a55c449f35c2f9db7c2df54465028d9"}
