{"accepted": 0, "answer": "Anything boiled should be safe to drink and the dust on the cups shouldn't really be a problem either. In my experience most things in India tend to have a layer of dust on them no matter how fastidious you are. I disagree with hippietrail about using popular places to judge their safety popularity can be an indicator but it's not a guarantee that you won't get ill. Most of the reason that travelers get sick is because they're consuming something their bodies either can't handle or haven't built up tolerance to. Also keep in mind that what the dine in portion of a restaurant looks like isn't always indicative of what the kitchen looks like. I once was in a restaurant that was impeccable in the part where the customers were but I saw the door to the kitchen swing open and there was a standing measure of dirty muddy water with insects and dirty dishes everywhere. Cold drinks and foods are usually more dangerous as others have pointed out you should be careful about fresh fruits or vegetables that you haven't prepared and always either decline ice in your drink or specifically ask if it was made from filtered water you might need to use the term R O water filtered through reverse osmosis . Ice cream kulfi that isn't pre packaged can be dangerous too street vendors typically don't wash their hands often. The bottom line is to be cautious without detracting from your sense of adventure and experiencing everything India has to offer. Ask if you have questions about the way something is prepared be observant about the conditions of your food and its preparation and when in doubt go with your gut no pun intended . ", "answerScore": "14", "authorUserId": "149", "authorUsername": "fredley", "downModVotes": 0, "id": 1180, "subtitle": "There are many street tea coffee sellers around India and although the water has been boiled at some point often the pots are out for a long time. The clay cups are also lying around in the dust. Is it safe to drink? Image courtesy of Proxy Indian a em ", "tags": "<india><safety><food-and-drink><coffee>", "title": "Is tea and coffee on the street safe to drink in India?", "upModVotes": 14, "userId": "489", "userReputation": 3002, "username": "Laura", "views": 4707}
