{"accepted": 1, "answer": "Embassies and consulates will only assist their own citizens. For example the section of the US embassy that performs this function is called American Citizen Services . You and your spouse would have to contact your respective countries' embassies. As your children are dual citizens they could get assistance from either embassy. Only in exceedingly rare emergency situations such as evacuations during times of war you might get assistance for your entire family despite that fact that some members are non citizens. For anything else routine you would have to visit your home country's embassy. Many people are under the impression usually from watching too many movies that an embassy will going to extraordinary lengths to protect their citizens. In reality it is usually the opposite and the embassy will rarely intervene in emergencies. For example if you are arrested in a foreign country you should only expect a consular visit and the telephone number of a local lawyer. If you run out of money they are not going to loan you money to fly home etc. Finally in theory EU citizens can visit the embassy of any other EU country if their home country does not have local representation. For example Portugal does not have an embassy in Cambodia but in theory a Portuguese citizen living there could receive assistance at the French Embassy there. I've heard that in practice that this doesn't work as well as it should. ", "answerScore": "16", "authorUserId": null, "authorUsername": 0, "downModVotes": 0, "id": 1100, "subtitle": "This is a question we have asked our self a lot but never found a proper answer. We are a couple with different nationalities where our children have both. We are wondering which Embassy we should contact abroad in case we need consular support or would the family in that case be split to get support from each embassy consulate. Luckily we haven't been in a situation where we would need consular support. Hopefully we would never have to but still it would be nice to know in case something happens. ", "tags": "<embassies><consulates><services>", "title": "Which embassy consulate to contact when you need consular support for a family where the parents have different nationalities?", "upModVotes": 16, "userId": "11", "userReputation": 4305, "username": "user27478", "views": 352}
