{"author_metadata": {"username": "Raj More", "id": "33"}, "question_metadata": {"score": 4, "id": "135", "tags": "<safety><international-travel>", "views": 292}, "text": "You do not need to stay at a 5-star hotel for security. In fact, I've had a number of things stolen from nice hotels. I prefer a place with a locker that does NOT have a built in lock. So, you can attach your own. Passports and money can go in there.\nI avoid money belts. They are easy to spot if someone asks you to lift up your shirt. I actually have a loop stitched to the inside of my pants that I attach a small pouch with my passport and extra money.\nAlways carry some cash in your wallet. I like to keep about 20 euros (or equivalent) in there. If you get mugged or pick-pocketed, it typically will make them happy and they won't go searching for more. If you don't have any money in your wallet, I've seen muggers start to search the person for more.\nSecond, are the big three, recognized by most experienced travellers:\n1) Avoid prostitution. Aside from the obviousness of the danger, many rings are run by people you don't want to be involved with.\n2) Avoid gambling. Same reason as above.\n3) Avoid rough bars. I consider these any place where people will 'look the other way.' \n", "question": {"subtitle": "Most people in first world countries have a very different idea of \"safe\".  First world country houses do not have bars on the windows, the yard may not even have a fence, a hotel that looks good from outside is usually a good bet inside.  Most protection mechanisms are intended to keep the honest person honest.\nWhen such people travel into the a third-world country, their parameters of \"safe\" need probably to be a adjusted little bit.\nWhat are some of the safety related changes one one should be be congnizant of when traveling to a third world-country?\n", "title": "Being safe in an unknown place"}, "user_metadata": {"username": "Beaker", "reputation": 3553, "id": "85"}, "answer_metadata": {"accepted": 0, "length": 1089, "score": 3, "upModVotes": 3, "downModVotes": 0, "id": "146"}, "id": "06f9570803b7382c87968d035e40f02d"}
