{"accepted": 1, "answer": "Tuesday is national museum closing day in France. Many state owned museums a are closed on Tuesdays as are many local museums outside Paris. In Paris most city owned museums are closed on Mondays. Some museums are open later on one night a week usually Thursdays. Most museums close on some public holidays a but not all. There are many exceptions so always check before you go. I think the reason why Tuesday was picked as a closing day is that normal people should be able to visit museums so they are open on Saturdays and Sundays. Many shops are closed on Mondays so museums are open that day for the sake of people who work in shops. In Paris most shops are open on Mondays so there is less point in opening the museums for their sake. Here are a few popular attractions that close on Tuesdays Louvre a li Centre Pompidou a national modern arts museum li Musum d'Histoire Naturelle a natural history museum li Muse de l'Orangerie a Tuileries li ul Here are a few popular attractions that close on Mondays Versailles palace a the grounds open every day li Muse d'Orsay a classical arts li Muse du Quai Branly a indigenous art li Muse Carnavalet a history of Paris li Muse d'Art Moderne de la ville de Paris a municipal modern art museum li Muse Rodin a li Grand Palais a may depend on the exhibition li Petit Palais a li Muse des Arts Dcoratifs a design li Muse des Arts et Mtiers a arts and crafts li Cit des Sciences et de l'Industrie a La Villette technology museum li ul Here are a few popular attractions that open 7 days a week except holidays Tour Eiffel a li Panthon a li Muse de l'Arme a military museum in the Invalides li Muse Grvin a wax figures li ul This site a has a list of museums in Paris with addresses opening dates and times and prices. At a glance it looks reasonably accurate. Roughly the top visited museums according to Musostat a . sub ", "answerScore": "14", "authorUserId": "26", "authorUsername": "Gagravarr", "downModVotes": 0, "id": 1169, "subtitle": "One that's caught me out before is that the Louvre is closed on Tuesdays a . It looks like the Centre Pompidou is also closed Tuesdays a French Tuesday Mardi . However the Paris Modern Art Museum Muse d'Art Moderne de la Ville de Paris is closed Mondays a and the Eiffel Tower is open every day a so it's not a universal thing. Without wishing to build a list of the closing days of all of Paris's attractions are there any other big name attractions that are also closed on a Tuesday or are those the only two big ones to catch the unwary visitor out? ", "tags": "<planning><sightseeing><france><paris><landmarks>", "title": "Paris on a Tuesday are the Louvre and the Pompidou Centre the only big attractions that are closed?", "upModVotes": 14, "userId": "277", "userReputation": 12888, "username": "Gilles", "views": 8123}
